Repository: pypi-data/pypi-mirror-50
Catalog: packages/pretix-cartshare/pretix-cartshare-1.6.tar.gz/pretix-cartshare-1.6/pretix_cartshare/locale/*/LC_MESSAGES/django.po
Languages: es, nl

source: Count
es: Cantidad
nl: Aantal

source: Price per item (empty for default)
es: Precio por item (vacio predeterminado)
nl: Prijs per artikel (standaard leeg)

source: Event
es: Evento
nl: Evenement

source: Cart ID
es: ID del Cart
nl: Winkelwagen ID

source: Date
es: Fecha
nl: Datum

source: Expiration date
es: Fecha de expiraci칩n
nl: Verloopdatum

source: Total
nl: Totaal

source: Share a cart
es: Compartir cart
nl: Deel een winkelwagen

source: Create a cart
es: Crear un cart
nl: Maak een winkelwagen aan

source: Cart positions
es: Posiciones del carrito
nl: Producten in winkelwagen

source: Add a product
es: Agregar producto
nl: Voeg een product toe

source: Save
es: Guardar
nl: Opslaan

source: Delete cart
es: Eliminar cart
nl: Winkelwagen verwijderen

source: Are you sure you want to delete the shared cart <strong>%(cart.cart_id)s</strong>?
es: Est치s seguro que deseas eliminar el carrito compartido <strong> %(cart.cart_id)s</strong>?
nl: Weet u zeker dat u de gedeelde winkelwagen <strong>%(cart.cart_id)s</strong> wilt verwijderen?

source: Cancel
es: Cancelar
nl: Annuleren

source: Delete
es: Eliminar
nl: Verwijderen

source: Carts
es: Carritos
nl: Winkelwagens

source: No carts found.
es: No se encontraron carts.
nl: Geen winkelwagens gevonden.

source: Create a new cart
es: Crear un cart nuevo
nl: Maak een nieuwe winkelwagen aan

source: Created
es: Creado
nl: Aangemaakt

source: Expires
es: Expira
nl: Vervalt

source: Redeem a shared cart
es: Redimir un carrito compartido
nl: Wissel een gedeelde winkelwagen in

source: Shared cart
es: Carrito compartido
nl: Gedeelde winkelwagen

source: Click on the button to buy these items now. Please note that the button can only be clicked once. If you click it, you will need to confirm the order within %(minutes)s minutes and you will not be able to use this link again.
nl: Klik op de knop om deze artikelen nu te kopen. Houd er rekening mee dat er op deze knop slechts éénmalig geklikt kan worden. Als u erop klikt moet u de bestelling binnen %(minutes)s minutens bevestigen en kun u deze link niet opnieuw gebruiken.

source: Add to my cart and buy
es: Agregar a mi carrito y comprar
nl: Voeg toe aan mijn winkelwagen en reken af

source: The quota {name} does not have enough capacity left to perform the operation.
es: La cuota {name} no tiene suficiente capacidad para realizar la operaci칩n.
nl: Het quotum {name} heeft niet genoeg beschikbare capaciteit om deze opdracht uit te voeren.

source: Your input was invalid
es: Tu entrada es inv치lida
nl: Uw invoer was ongeldig

source: The cart has been saved. You can now share the following URL: {url}
es: Tu carrito ha sido guardado. Ahora puedes compartir el siguiente URL: {url}
nl: Uw winkelwagen is opgeslagen. U kunt deze nu delen via de volgende URL: {url}

source: The requested shared cart does not exist.
es: El carrito compartido solicitado no existe.
nl: De opgevraagde gedeelde winkelwagen bestaat niet.

source: The selected cart has been deleted.
es: El carrito selecionado ha sido eliminado.
nl: De geselecteerde winkelwagen werd verwijderd.

source: Product
es: Producto
