Repository: pypi-data/pypi-mirror-50
Catalog: packages/cubicweb-dataprocessing/cubicweb-dataprocessing-0.3.0.tar.gz/cubicweb-dataprocessing-0.3.0/i18n/*.po
Languages: fr

source: A File may be produced by a transformation process
fr: Un fichier peut-être produit par un processus de transformation

source: A File may be validated by a validation process
fr: Un fichier peut-être validé par un processus de validation

source: A sequence of scripts involved in a given process.
fr: Une série de scripts utilisés dans un processus

source: A step in a transformation sequence.
fr: Une étape de transformation

source: Data transformation process
fr: Processus de transformation de données

source: Data validation process
fr: Processus de validation de données

source: DataTransformationProcess
fr: Processus de transformation

source: DataTransformationProcess_plural
fr: Processus de transformation

source: DataValidationProcess
fr: Processus de validation

source: DataValidationProcess_plural
fr: Processus de validation

source: New DataTransformationProcess
fr: Nouveau processus de transformation

source: New DataValidationProcess
fr: Nouveau processus de validation

source: New TransformationScript
fr: Nouveau script de transformation

source: New TransformationSequence
fr: Nouvelle série de scripts de transformation

source: New TransformationStep
fr: Nouvelle étape de transformation

source: New ValidationScript
fr: Nouveau script de validation

source: This DataTransformationProcess
fr: Ce processus de transformation

source: This DataTransformationProcess:
fr: Ce processus de transformation :

source: This DataValidationProcess
fr: Ce processus de validation

source: This DataValidationProcess:
fr: Ce processus de validation :

source: This TransformationScript
fr: Ce script de transformation

source: This TransformationScript:
fr: Ce script de transformation :

source: This TransformationSequence
fr: Cette série de transformations

source: This TransformationSequence:
fr: Cette série de transformations :

source: This TransformationStep
fr: Cette étape de transformation

source: This TransformationStep:
fr: Cette étape de transformation :

source: This ValidationScript
fr: Ce script de validation

source: This ValidationScript:
fr: Ce script de validation :

source: TransformationScript
fr: Script de transformation

source: TransformationScript_plural
fr: Scripts de transformation

source: TransformationSequence
fr: Série de transformation

source: TransformationSequence_plural
fr: Séries de transformation

source: TransformationStep
fr: Étape de transformation

source: TransformationStep_plural
fr: Étapes de transformation

source: ValidationScript
fr: Script de validation

source: ValidationScript_plural
fr: Scripts de validation

source: add TransformationStep in_sequence TransformationSequence object
fr: ajouter une étape de transformation

source: add a DataTransformationProcess
fr: ajouter un processus de transformation

source: add a DataValidationProcess
fr: ajouter un processus de validation

source: add a TransformationScript
fr: ajouter un script de transformation

source: add a TransformationSequence
fr: ajouter une série de transformation

source: add a TransformationStep
fr: ajouter une étape de transformation

source: add a ValidationScript
fr: ajouter une script de validation

source: creating TransformationStep (TransformationStep in_sequence TransformationSequence %(linkto)s)
fr: création d'une étape de transformation (dans la série %(linkto)s)

source: implemented_by
fr: implémenté par

source: implemented_by_object
fr: scripts

source: in_sequence
fr: dans la série

source: in_sequence_object
fr: étapes

source: index
fr: indice

source: input file of the data process
fr: fichier d'entrée du processus de données

# TransformationScript
source: name
fr: nom

source: output_format
fr: format de sortie

source: parameters
fr: paramètres

source: parameters for the script, will be used as JSON data structure
fr: paramètres du script, sous la forme d'une structure de données JSON

source: position in the transformation sequence
fr: postition dans une série de transformations

source: process_depends_on
fr: dépend de

source: process_depends_on_object
fr: dépendences

source: process_input_file
fr: fichier d'entrée

source: process_input_file_object
fr: utilisé dans le processus

source: process_stderr
fr: sortie d'erreur

source: produced_by
fr: produit par

source: produced_by_object
fr: produits

source: standard error output
fr: sortie d'erreur standard

source: step_script
fr: script

source: step_script_object
fr: étape de transformation

source: the resource (file) implementing a script
fr: la ressource (fichier) implémentant ce script

source: transformation_scripts
fr: scripts de transformation

source: transformation_scripts_object
fr: processus de transformation

source: transformation_sequence
fr: série de transformations

source: transformation_sequence_object
fr: processus

source: validated_by
fr: validé par

source: validated_by_object
fr: fichiers validés

source: validation_script
fr: script de validation

source: validation_script_object
fr: utilisé dans les processus de validation

source: wfs_dataprocess_completed
fr: terminé

source: wfs_dataprocess_error
fr: erreur

source: wfs_dataprocess_in_progress
fr: en cours

source: wfs_dataprocess_initialized
fr: initialisé

source: wft_dataprocess_complete
fr: terminer

source: wft_dataprocess_error
fr: mise en erreur

source: wft_dataprocess_start
fr: démarrer
